/**
 * @fileoverview Плагин ESLint, созданный для закрытия собственных нужд линтинга, на основе плагина Тимура Ульби
 * @author Michael E. Ershov
 */
"use strict";

//------------------------------------------------------------------------------
// Requirements
//------------------------------------------------------------------------------

const requireIndex = require("requireindex");

//------------------------------------------------------------------------------
// Plugin Definition
//------------------------------------------------------------------------------


// import all rules in lib/rules
module.exports.rules = requireIndex(__dirname + "/rules");



